Autodesk.Revit.DB.TransactionGroup.SetName(System.String)
Sets the transaction group's name.
Remarks:
Transaction group only needs a name if it is going to be assimilated at the end.
name:
A name for the transaction group.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.TransactionGroup.Start(System.String)
Starts the transaction group with an assigned name.
Remarks:
A transaction group can be started only when there is no transaction started currently.
It can be started inside another transaction group though. With such group nesting
it is required that inner transaction groups are finished (i.e. rolled back, committed,
or assimilated) before outer groups are.
transGroupName:
Name of the group.
The name will be used only for a group that is assimilated at the end.
Returns:
If started successfully, this method returns TransactionStatus.Started.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled.
-or-
Transaction group cannot be started during an active transaction.
-or-
The Transaction group has already been started.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.#ctor(Autodesk.Revit.DB.Document,System.String)
It constructs a transaction group object
Remarks:
The group does not start until its Start method is called.
document:
The document for which this transaction group is being used.
transGroupName:
Name of the group.
The name will be used only for a group that is assimilated at the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.TransactionGroup.#ctor(Autodesk.Revit.DB.Document)
Constructs a transaction group object.
Remarks:
The group does not start until its Start method is called.
document:
The document for which this transaction group is being used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011